from dataclasses import dataclass

MAILS_MAPPING = {
    'report': {
        'subject': 'Новое сообщение от yakvy_bot',
        'text': '<h2>Здравствуйте</h2> '
                '<br>'
                'Отчет за последний интервал опроса'
                '<br><br>'
                '<font size="-2">Это сообщение было отправлено автоматически. '
                'Ваш ответ на письмо не требуется.</font>',
        'format': 'otp'
    },
    'otp': {
        'subject': 'Новое сообщение от Nazv\'yazku Bot',
        'text': '<h2>Здравствуйте</h2> '
                '<br>'
                'Ваш проверочный код: {}'
                '<br>'
                'Код действителен 24 часа.'
                '<br><br>'
                '<font size="-2">Это сообщение было отправлено автоматически. '
                'Ваш ответ на письмо не требуется.</font>',
        'format': 'otp'
    },
}

WARNINGS = {
    'welcome': 'Шановний колего, ми розробили чат\-бот, щоб відслідковувати вашу доступність та розуміти, '
               'чи в безпечному '
               'місці ви зараз перебуваєте\. Продовжити авторизацію через: ',
    'prompt_otp': 'На ваш телефон та пошту надійшов 4-х значний код в SMS. Вкажіть його ',
    'self_delete': 'Ваш запис у базі даних було видалено, флоу буде перезапущено ',
    'otp_failed': 'Ви вказали невірний код, спробуйте ще раз',
    'employee_not_found': 'Коритувача не було знайдено❗️ \n  \nПеревірте коректність даних або оберіть інший '
                          'спосіб авторизації',
    'verification_succeeded': 'Авторизація пройшла успішно! Відтепер щотижня будете отримувати запит для '
                              'підтвердження того, що ви на зв\'язку та доступні \n  \n'
                              'Додатково щотижня у той самий час просимо вказавати населений пункт або місто, '
                              'де ви перебуваєте в поточний момент\n  \n'
                              'Важливо: ми не отримуємо доступу до вашої геолокації, вся надана '
                              'інформація надійно захищена згідно з політикою Метінвесту',
    'agreement': 'Я ознайомився з формами про збір та обробку персональних даних, розміщеними за посиланням '
                 'https://bit\.ly/3JTcVi5 та даю свою згоду',

    'graph_request_aborted': 'Active Directory not responding',
    'graph_validation_error': 'Невірний формат',
    'region': 'В якому населеному пункті ви зараз? Відповідь може бути лише українською або '
              'російською мовою та без додавання скорочення, '
              'наприклад, \"г\", \"м\", \"с\"',
    'region_select': 'Будь ласка, зробіть вибір, натиснувши відповідну кнопку',
    'region_error': 'Відповідь може бути лише українською або російською мовою та без додавання скорочення, '
                    'наприклад, \"г\", \"м\", \"с\"',

    'unmatched': 'Надрукуй будь-який з наведених нижче варіантів, якщо ти на зв\'язку: +, y, д, да, так, yes',
    'hope': 'Раді були вас почути 🙏🏽  \n  \nДо наступної зустрічі та бережіть себе! \n  \n'
            'До речі, ви у будь-який момент можете самостійно змінити місце вашого перебування, '
            'для цього надішліть будь-яке повідомлення боту',
    'online': 'Ви на зв\'язку? ',
    'yes': 'Так',

    'error': 'Невідома помилка! \n  \nВведіть будь-яке повідомлення: ',
    'employee_id_welcome': 'Необхідно вказати табельний номер із 8 цифр! \n  \nЯкщо у вас табельний номер складається '
                           'не з 8ми цифр, то ознайомтесь з інструкцією за посиланням https://bit.ly/3qSDBrD',
    'employee_id_prompt': 'Будь ласка, вкажіть ваш табельний номер, 8 цифр: ',
    'email_welcome': 'Будь ласка, вкажіть вашу електронну адресу. '
                     'пошта може бути у форматі @metinvestholding.com або @metinvest.digital ',
    'mobile_welcome': 'Будь ласка, вкажіть ваш телефон у форматі +38XXXYYYYYY',
    'mobile_failed': 'Невірний формат номера (+380XXYYYYYYY)',
    'incorrect_mobile': 'Номер телефону не вірний\. Вкажіть телефон у форматі +38XXXYYYYYY',
    'mobile_not_found': 'Номера телефону немає в базі, пропонуємо тобі пройти авторизацію через електронну пошту, '
                        'або вказати інший номер.  ',
    'actualize_region_data': 'Чи актуальні дані про ваше місцезнаходження?',
    'none_region_data': 'Введіть назву міста вашого перебування',
    'full_address_want': 'Бажаєте вказати фактичну адресу вашого перебування?',
    'full_address': 'Вкажіть фактичну адресу вашого перебування',

    'identifier_failed': 'Невірний формат ідентифікатора, перевірте коректність даних та спробуйте ще раз ',
    'region_tg_channel': '📣️ Регіональний телеграм канал:\n{}',
    'reply_was_received': 'Ви вже внесли дані про місцезнаходження ✅  \n  \n'
                          'Плановий запит на оновлення вашого місця перебування буде найближчого понеділка, '
                          'але якщо ваше місце перебування змінилося, то можна внести зміни зараз',
    'update_geo_error': 'Не вдалося зберегти ваші дані, необхідно пройти діалог заново '
}

VIBER_COPYRIGHTS = {
    'error': 'Введіть будь-яке повідомлення: ',
    'welcome': 'Шановний колего, ми розробили чат-бот, щоб відслідковувати вашу доступність та розуміти, '
               'чи в безпечному місці ви зараз знаходитися.\n'
               'Введіть ваш табельний номер(приклад https://bit.ly/3qSDBrD)\n'
               'або корпоративну пошту(формат @metinvestholding.com або @metinvest.digital)\n'
               'чи номер телефону(формат +38XXXYYYYYY) ',
    'employee_not_found': 'Коритувача не було знайдено❗️\n'
                          'Перевірте коректність даних або оберіть інший спосіб авторизації',
    'prompt_otp': 'На ваш телефон та пошту надійшов 4-х значний код в SMS. Вкажіть його ',
    'otp_failed': 'Ви вказали невірний код, спробуйте ще раз',
    'agreement': 'Я ознайомився з формами про збір та обробку персональних даних, розміщеними за посиланням '
                 'https://bit.ly/3JTcVi5 та даю свою згоду',
    'not_agreement': 'У разі згоди надрукуйте так або +',

    'verification_succeeded': 'Авторизація пройшла успішно! Тепер раз на тиждень о 10:00 ранку будете отримувати '
                              'запит для підтвердження того, що ви на зв\'язку та доступні.\n'
                              'Додатково раз на тиждень у той самий час просимо вказавати населений пункт '
                              'або місто, де ви знаходитеся в поточний момент\n  \n'
                              'Важливо: ми не отримуємо доступу до вашої геолокації, вся надана інформація '
                              'надійно захищена згідно політик Холдингу',
}

REGION_TG = {
    'Київ': 'https://t.me/+pSLnk5SkdaY2OWEy',
    'Запорізька область': 'https://t.me/+OsGtClRR2SwyNmIy',
    'Дніпропетровська область': 'https://t.me/+uXDgUM2lbikxNTgy',
    'Івано-Франківська область': 'https://t.me/+DFcBHILXyWFlMGRi',
    'Львівська область': 'https://t.me/+xqVdWOv-9u1kNjU6',
    'Одеська область': 'https://t.me/+VwmYx4zOdO1iZGIy',
    'Закарпатська область': 'https://t.me/+y4F_30YOOeM5MjRi',
    'Хмельницька область': 'https://t.me/+OHbFN3rRKyI3MjAy',
    'Вінницька область': 'https://t.me/+fQTvumNcaUQ0NDQy',
}

COUNTRY_TG = {
    'Болгарія': 'https://t.me/+-DW1TRmNmT45ZTZi',
    'Польща ': 'https://t.me/+r7og9yHGIFo4YzEy',
    'Німеччина ': 'https://t.me/+zBj7I0CmcIU5YjUy',
    'Чехiя': 'https://t.me/+HYi1OOegcew0YjE6',
}
